Reports/ЭффективностьМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ЭффективностьМенеджеров</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/Замеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Замеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Невыходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамерВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗамерщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтсутствиеИсполнителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыЗамера</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатЗамераЛида</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатыВыездаЛида</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказаЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Геометка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначенияЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументЗамер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗамера</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамерПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЭффективностьМенеджеров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПредставлениеПоказателя(КлючТекущегоВарианта = "") Экспорт
	
	Возврат "Менеджер"; // #14909 п.2 - всегда "Менеджер"
	
	//Если КлючТекущегоВарианта = "АнализЛидовВПериодеОтчета"       					// 1.
	//	ИЛИ КлючТекущегоВарианта = "АнализДоговоровПоДатеЛида"                      // 4.
	//	ИЛИ КлючТекущегоВарианта = "АнализДоговоровПоМенеджеруЛидаИДатеДоговора"   	// 5.
	//	ИЛИ КлючТекущегоВарианта = "АнализПрайсаПоДатеЛида"                         // 7.
	//	ИЛИ КлючТекущегоВарианта = "АнализМонтажейПоМенеджерамЛида" Тогда           // 9.
	//	Возврат "Менеджер лида";
	//	
	//ИначеЕсли КлючТекущегоВарианта = "АнализЗамеровПоДатеЛида"    					// 2. 
	//	ИЛИ КлючТекущегоВарианта = "АнализЗамеровПоДатеНазначения" Тогда   			// 3.
	//	Возврат "Менеджер, назначивший лид";                                     		
	//	
	//ИначеЕсли КлючТекущегоВарианта = "АнализДоговоровПоДатеДоговора"               	// 6.
	//	ИЛИ КлючТекущегоВарианта = "АнализПрайсаПоДатеДоговора" Тогда               // 8.
	//	Возврат "Менеджер договора";	
	//			
	//КонецЕсли;
	//
	//Возврат "Менеджер";
	
КонецФункции

Функция ТипДанныхПоказателяСтрокой() Экспорт
	
	Возврат "СправочникСсылка.Сотрудники";
	
КонецФункции

// основная функция, где описываются разделы, показатели, тексты запросов для их вычисления
Функция ТаблицаДоступныхПоказателей(Знач ПолеПоказателя="", Знач ТипПоказателя="") Экспорт
	
	Возврат ОтчетыЭффективности.ТаблицаДоступныхПоказателейПоМенеджерам(ПолеПоказателя, ТипПоказателя);
	
КонецФункции

Функция ДополнитьТекстЗапросаВТ(ТекстЗапроса) Экспорт
	
	// общие таблицы
	ОтчетыЭффективности.ДополнитьТекстЗапросаВТ(ТекстЗапроса);
	
	// таблицы отчета
	
КонецФункции
	
Функция НастройкиВариантаОтчета(ОтчетСсылка, КлючВарианта, Предопределенный) Экспорт
	
	Результат = ОтчетыЭффективности.ПустаяТаблицаПоказателей();
	
	ТаблицаДоступныхПоказателей = ТаблицаДоступныхПоказателей();
	
	// настройки предопределенных храним "внутри" отчета
	Если Предопределенный Тогда		
		
		Если КлючВарианта = "ВсеПоказатели" Тогда
			Для каждого СтрокаТЗ из ТаблицаДоступныхПоказателей Цикл
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			КонецЦикла;
			
		ИначеЕсли КлючВарианта = "АнализЛидовВПериодеОтчета" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоСозданныхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЦелевыхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентЦелевыхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЛидовОбращений", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентЛидовОбращений", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоНецелевыхЛидов", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентНецелевыхЛидов", Результат);
			
		ИначеЕсли КлючВарианта = "АнализЗамеровПоДатеЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеЛидаМенеджерСовпадает", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияЗамеровПоДатеЛидаМенеджерСовпадает", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеЛидаМенеджерНеСовпадает", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияЗамеровПоДатеЛидаМенеджерНеСовпадает", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровВРаботеПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровПоДатеЛида", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровОтмененныеПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеЛида", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровЗамерщикаПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровЗамерщикаПоДатеЛида", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеЛидаДоговоровКВыполненнымЗамерам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеЛидаДоговоровКНазначеннымЗамерам", Результат);
				
		ИначеЕсли КлючВарианта = "АнализЗамеровПоДатеНазначения" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеНазначенияМенеджерСовпадает", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияЗамеровПоДатеНазначенияМенеджерСовпадает", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровПоДатеНазначенияМенеджерНеСовпадает", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияЗамеровПоДатеНазначенияМенеджерНеСовпадает", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗамеровВРаботеПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровПоДатеНазначения", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровОтмененныеПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровЗаключенДоговорПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровДоговорНеЗаключенПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоЗакрытыхЗамеровНеПроизводилсяПоДатеНазначения", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоДатеНазначения", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДатеНазначения", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеНазначенияДоговоровКВыполненнымЗамерам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КонверсияПоДатеНазначенияДоговоровКНазначеннымЗамерам", Результат);
			
		ИначеЕсли КлючВарианта = "АнализДоговоровПоДатеЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоПотолковПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковПоЛидам", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднееКоличествоПотолковПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСуммаДоговораПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийЧекПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСтоимостьМетраПоЛидам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяПлощадьПоЛидам", Результат);
			
		// #14776 новый вариант
		ИначеЕсли КлючВарианта = "АнализДоговоровПоМенеджеруЛидаИДатеДоговора" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоДоговорамСМенеджеромЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорамСМенеджеромЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоПотолковПоДоговорамСМенеджеромЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПоДоговорамСМенеджеромЛида", Результат);

			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднееКоличествоПотолковПоДоговорамСМенеджеромЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСуммаДоговораПоДоговорамСМенеджеромЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийЧекПоДоговорамСМенеджеромЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСтоимостьМетраПоДоговорамСМенеджеромЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяПлощадьПоДоговорамСМенеджеромЛида", Результат);

		ИначеЕсли КлючВарианта = "АнализДоговоровПоДатеДоговора" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "КоличествоПотолковПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПоДоговорам", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднееКоличествоПотолковПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСуммаДоговораПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийЧекПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяСтоимостьМетраПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СредняяПлощадьПоДоговорам", Результат);
						
		ИначеЕсли КлючВарианта = "АнализПрайсаПоДатеЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоПрайсуПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаОтклоненияОтПрайсаПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентОтклоненияОтПрайсаПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаСкидкиДоговоровПоДатеЛида", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийПроцентСкидкиДоговоровПоДатеЛида", Результат);
			
		ИначеЕсли КлючВарианта = "АнализПрайсаПоДатеДоговора" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаДоговоровПоДоговорамПоПрайсу", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаОтклоненияПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПроцентОтклоненияОтПрайсаПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаСкидкиДоговоровПоДоговорам", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СреднийПроцентСкидкиДоговоровПоДоговорам", Результат);
			
		ИначеЕсли КлючВарианта = "АнализМонтажейПоМенеджерамЛида" Тогда
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеЗамера", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеЗамера", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеДоговора", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеДоговора", Результат);
			
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "СуммаМонтажейПоДатеМонтажа", Результат);
			ОтчетыЭффективности.ДобавитьПоказательВПредопределенныйВариантОтчета(ТаблицаДоступныхПоказателей, "ПлощадьПотолковМонтажейПоДатеМонтажа", Результат);

		КонецЕсли;
		
	Иначе
		
		ОтчетыЭффективности.ЗаполнитьНастройкиПользовательскогоВариантаОтчета(ОтчетСсылка, КлючВарианта, ТаблицаДоступныхПоказателей, Результат);
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область УДАЛИТЬ

Процедура УДАЛИТЬ_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//++ №11768 формируем запрос используя внешние наборы данных
	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина); // #4888
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	//++ #12385
	//ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("НачалоПериода"));
	//НачалоПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД);
	//
	//ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("КонецПериода"));
	//КонецПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД, ТекущаяДатаСеанса());
	
	ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("СтПериод"));
	НачалоПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД.Значение.ДатаНачала, ТекущаяДатаСеанса());
	КонецПериода  = ОбщийМодульСервер.ПолучитьДатуПоПараметру(ПараметрСКД.Значение.ДатаОкончания, ТекущаяДатаСеанса());
	//-- #12385
	
	Вид = "Менеджер";
	//ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("Вид"));
	//Если Не ПараметрСКД = Неопределено Тогда
	//	Вид = ПараметрСКД.Значение;
	//КонецЕсли;	
	//ПараметрТипДиаграммы = Неопределено;
	//ПараметрСКД = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(новый ПараметрКомпоновкиДанных("ТипДиаграммы"));
	//Если Не ПараметрСКД = Неопределено Тогда
	//	ПараметрТипДиаграммы = ПараметрСКД.Значение;
	//КонецЕсли;	
	
	//#12382
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) И НачалоПериода > КонецПериода Тогда
		ВызватьИсключение "Неправильно задан период: начало периода должно быть меньше или равно окончанию";
	КонецЕсли;
	
	// Формируем данные по таблицам (так, как они визуально выглядят в отчёте)
	МенеджерВТ = новый МенеджерВременныхТаблиц;
	ВременныеТаблицы = ОбщийМодульСервер.СформироватьДанныеВоВременныеТаблицы(МенеджерВТ, НачалоПериода, КонецПериода, Вид);
	
	СтруктураТаблиц = новый Структура;
	СтруктураТаблиц.Вставить("ПоДатеНазначенияЗамера", ПолучитьТаблицуОсновная(НачалоПериода, КонецПериода));
	
	СтруктураТаблиц.Вставить("ПоДатеЛида", ОбщийМодульСервер.ПолучитьТаблицуПоДатеЛида(МенеджерВТ, НачалоПериода, КонецПериода, Ложь));
	// Вторая таблица полностью по вычисляемым полям Конверсии
	СтруктураТаблиц.Вставить("ПоДатеЛидаПродолжение", ОбщийМодульСервер.ПолучитьТаблицуПоДатеЛидаПродолжение(МенеджерВТ, НачалоПериода, КонецПериода));
	СтруктураТаблиц.Вставить("ПоДатеДоговора", ОбщийМодульСервер.ПолучитьТаблицуПоДатеДоговора(МенеджерВТ, НачалоПериода, КонецПериода));
	
	//#12914 новая таблица
	СтруктураТаблиц.Вставить("ПоМонтажам", ОбщийМодульСервер.ПолучитьТаблицуПоМонтажам(МенеджерВТ, НачалоПериода, КонецПериода));
	
	ВнешниеНаборыДанных = новый Структура("Основной", ОбщийМодульСервер.ОбъединитьТаблицыНаборовДанных(СтруктураТаблиц));
	
	//Выбор типа диаграммы
	//ТипДиаграммы.ГистограммаГоризонтальная;
	//ТипДиаграммы.ГистограммаГоризонтальнаяОбъемная;
	//ТипДиаграммы.ГистограммаСНакоплениемГоризонтальная;
	//ТипДиаграммы.ГистограммаСНакоплениемГоризонтальнаяОбъемная;
	
	//Если ПараметрТипДиаграммы <> Неопределено Тогда
	//	Для	Каждого СтруктураВывода Из НастройкиОтчета.Структура Цикл
	//		Если ТипЗнч(СтруктураВывода) = Тип("ДиаграммаКомпоновкиДанных") Тогда
	//			Для Каждого ПараметрВывода Из СтруктураВывода.ПараметрыВывода.Элементы Цикл
	//				Если Строка(ПараметрВывода.Параметр) = "ТипДиаграммы" Тогда
	//					ПараметрВывода.Значение = ТипДиаграммы[ПараметрТипДиаграммы];
	//				КонецЕсли;	
	//			КонецЦикла;			
	//		КонецЕсли;	
	//	КонецЦикла;
	//КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ТабличныйДокумент = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Делаем центрирование групп полей
	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
			
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
			
			Если СтрНайти(НРег(Ячейка.Текст), "по дате лида") > 0
				Или СтрНайти(НРег(Ячейка.Текст), "договоры оформленные в период в независимости от даты лида") > 0
				Или СтрНайти(НРег(Ячейка.Текст), "отчет по монтажам") > 0
				Или СтрНайти(НРег(Ячейка.Текст), "за период") > 0
				ИЛИ СтрНайти(НРег(Ячейка.Текст), "по дате, когда был назначен замер") > 0
				Или СтрНайти(НРег(Ячейка.Текст), "количественные показатели") > 0

			Тогда
				Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	//-- №11768
	
КонецПроцедуры

//++ №11768 формируем запрос используя внешние наборы данных
Функция ПолучитьТаблицуОсновная(НачалоПериода, КонецПериода)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Замеры.ДокументЗамер КАК Контакт,
	//++ №10213 строим по показателю, кто назначил замер
	//|	Замеры.ДокументЗамер.Ответственный КАК Показатель,
	|	Замеры.НазначилЗамер КАК Показатель,
	// №13645 формируем по сотрудникам	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Показатель,
	//-- №10213
	|	СУММА(1) КАК КоличествоЗамеровПоДатеНазначенияЗамера,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.ЗамерВыполнен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВыполненныхЗамеровПоДатеНазначенияЗамера,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗамеровУспехПоДатеНазначенияЗамера,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ДоговорНеЗаключен)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗамеровОтказПоДатеНазначенияЗамера,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЗамеровНевыполненПоДатеНазначенияЗамера,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДоговоровНаЗамерахПоДатеНазначенияЗамера,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДоговоровПоДатеНазначенияЗамера,
	|	СУММА(ВЫБОР
	|			КОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗаключенДоговор)
	|				ТОГДА Замеры.СуммаДоговора
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДоговоровПоДатеНазначенияЗамера
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	//++ №13645 формируем по сотрудникам
	//// #12889 приводим тип показателя к "Пользователь"
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи 
	//|	ПО Пользователи.Сотрудник = Замеры.НазначилЗамер
	//|		И НЕ Замеры.НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	//-- №13645
	|ГДЕ
	|	НЕ Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
	|	И Замеры.ДатаНазначенияЗамера МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Замеры.ЭтоВыезд
	|
	|СГРУППИРОВАТЬ ПО
	|	Замеры.ДокументЗамер,
	|	Замеры.НазначилЗамер
	//++ №13645 формируем по сотрудникам|	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка),
	//|	-1,
	//|   0, 0, 0, 0, 0, 0, 0, 0
	|";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	//++ в колонке "Показатель" кроме показателя еще может быть текст
	КС = Новый КвалификаторыСтроки(20);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	//++ №13645 формируем по сотрудникам
	//МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
	//-- №13645 формируем по сотрудникам
	
	ОписаниеТиповС = Новый ОписаниеТипов(МассивТипов, , КС);
	
	ТаблицаРезультат.Колонки.Добавить("Показатель1", ОписаниеТиповС);
	
	Для каждого СтрокаТЧ из ТаблицаРезультат Цикл
		СтрокаТЧ.Показатель1 = СтрокаТЧ.Показатель; 	
	КонецЦикла;
	
	ТаблицаРезультат.Колонки.Показатель.Имя = "Показатель_Врем";
	ТаблицаРезультат.Колонки.Показатель1.Имя = "Показатель";
	ТаблицаРезультат.Колонки.Удалить("Показатель_Врем"); 
	
	Возврат ТаблицаРезультат;
	
КонецФункции
//-- №11768

#КонецОбласти
